
/*分页*/
//allPage 总页数
//nowPage 当前页
//allDataNum 总数据量
//showNum 显示的数据量
//showNumArr 选择显示数据量的下拉选择
//pageBoxClass 放分页的容器的class
//showPage 显示的页数
//pageFun 当当前页改变触发的函数
//showNumFun 当选择一页数据量的时候触发的函数
pageIng({
    allDataNum: 30,
    showNum: 10,
    showNumArr: [10, 20, 30],
    pageBoxClass: "pageFather",
    allPage: 100,
    showPage: 5,
    nowPage: 2,
    pageFun: function (num, O) {
        console.log(num);
        console.log(O);
    },
    showNumFun: function (num) {
        console.log(num);
    }
});



/*表格1*/
var dataSet = [
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","异常","1.78","67","肥胖","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","异常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","超重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","达标","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","及格","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","不及格","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","良好","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","营养不良","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","较低体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
    ["20160826001", "陈芝豹", "男", "22","九年8班","正常","1.78","67","正常体重","68","优秀","8009","达标","79","正常","正常","正常","查看"],
];
var tableObj=$(".tableBodyClass1").showTable({
    data:dataSet,
    title:[
        "姓名",
        "档案编号",
        "性别",
        "出生日期",
        "年龄",
        "始治日期",
        "始治方案",
        "更改方案",
        "随访次数",
        "是否做过入户随访",
        "是否结案",
        "登记号",
        "病案号",
        "更改方案",
        "随访次数",
        "是否做过入户随访",
        "是否结案",
        "登记号",
    ],
    scrollHeight:".tableBodyClass1",
    scrollHeightPC:45,
    widthInfo:["7.14%",
    "7.14%","4%",
    "4%","7.14%",
    "7.12%","4%",
    "4.75%", "4.75%",
    "4.75%","4.75%",
    "4.75%", "4.75%", "4.75%", "4.75%", "7.14%", "7.14%", -1],
    edit:false,
    isTitle:false,
    clickTd(){
        window.open('学生健康Tab切换.html');
    }
});




//换颜色
var tdArr = $(".showTableTd");
tdArr.each(function () {
    if ($(this).text() == "正常" || $(this).text() == "正常体重" || $(this).text() == "达标" || $(this).text() == "优秀") {
        $(this).addClass("nice");
    } else if ($(this).text() == "较低体重" || $(this).text() == "良好") {
        $(this).addClass("greet");
    } else if ($(this).text() == "未达标" || $(this).text() == "超重" || $(this).text() == "及格") {
        $(this).addClass("up");
    } else if ($(this).text() == "异常" || $(this).text() == "不及格" || $(this).text() == "肥胖") {
        $(this).addClass("fat");
    } else if ($(this).text() == "营养不良") {
        $(this).addClass("thin");
    } else if ($(this).text() == "查看") {
        $(this).addClass("watch");
    }
});
