//   时间控件
$(".datepicker").on('click', function(e){
    e.stopPropagation();
    $(this).lqdatetimepicker({
        css : 'datetime-day',
        dateType:"YYYY-MM-DD",
    });
});

//滚动条
// $(".zBox").panel({
//     iWheelStep:32,
//     scrollWIng:function(){
//         console.log(arguments);
//     }
// });

$(".scoll").panel({
    iWheelStep:32,
    scrollWIng:function(){
        console.log(arguments);
    }
});


//下拉
$(".cdct_select1").each(function(index,element){
    $(element).simulationSelect({selectText:'{a}<span class="selectDown"></span>'});
})

//tab
$("#save").on("click",function(){
    $(".tabButton").removeClass('non');
    $('.tabOfnewMechanism').on('click', '.tabButton', function(e) {
        var tab = $(e.target).attr('data');
        $('.tabButton').removeClass('cho');
        $(this).addClass('cho');
        $('.tab').each(function(index,element){
            $(element).hide();
            if($(element).hasClass(tab)){
                $(element).show();
            }
        });
        $('.tabNav').each(function(index,element){
            $(element).hide();
            if($(element).hasClass(tab)){
                $(element).show();
            }
        });
        tableObj1.heightSy();
        tableObj2.heightSy();
        tableObj3.heightSy();
    });
});


// 表单验证
var obj=$("form").validate({
    rules:{
        firstname:{
            required:true,
        },
        idcard:{
            required:true,
        },
    },
    errorClass:"errorClass_"
});
obj.form();

/*分页*/
//allPage 总页数
//nowPage 当前页
//allDataNum 总数据量
//showNum 显示的数据量
//showNumArr 选择显示数据量的下拉选择
//pageBoxClass 放分页的容器的class
//showPage 显示的页数
//pageFun 当当前页改变触发的函数
//showNumFun 当选择一页数据量的时候触发的函数
pageIng({
    allDataNum:30,
    showNum:10,
    showNumArr:[10,20,30],
    pageBoxClass:"pageFather",
    allPage:100,
    showPage: 5,
    nowPage:2,
    pageFun:function(num,O){
        console.log(num);
        console.log(O);
    },
    showNumFun:function(num){
        console.log(num);
    }
});

/*表格1*/
var dataSet = [
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"]
];
var tableObj1=$(".tablMainOne").showTable({
    data:dataSet,
    title:[
        "编号",
        "姓名",
        "档案编号",
        "性别",
        "出生日期",
        "年龄",
        "始治日期",
        "始治方案",
        "更改方案",
        "随访次数",
        "是否做过入户随访",
        "是否结案",
        "登记号",
        "病案号"
    ],
    scrollHeight:".tablMainOne",
    scrollHeightPC:45,
    edit:false
});
/*为表格添加横向滚动条*/
$(".tablMainOne").panel({
    iWheelStep:32,
    vScroll:false,
    scrollWResize:true
});






/*表格2*/
var dataSet2 = [
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"]
];
var tableObj2=$(".tablMainTwo").showTable({
    data:dataSet2,
    title:[
        "编号",
        "姓名",
        "档案编号",
        "性别",
        "出生日期",
        "年龄",
        "始治日期",
        "始治方案",
        "更改方案",
        "随访次数",
        "是否做过入户随访",
        "是否结案",
        "登记号",
        "病案号"
    ],
    scrollHeight:".tablMainTwo",
    scrollHeightPC:45,
    edit:false
});
/*为表格添加横向滚动条*/
$(".tablMainTwo").panel({
    iWheelStep:32,
    vScroll:false,
    scrollWResize:true
});

/*表格3*/
var dataSet3 = [
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"],
    [ '01', "张三", "001111", "男", "1955-05-05","26","1955-05-05","不治","不改","2","否","否","1","1"]
];
var tableObj3=$(".tablMainThree").showTable({
    data:dataSet3,
    title:[
        "编号",
        "姓名",
        "档案编号",
        "性别",
        "出生日期",
        "年龄",
        "始治日期",
        "始治方案",
        "更改方案",
        "随访次数",
        "是否做过入户随访",
        "是否结案",
        "登记号",
        "病案号"
    ],
    scrollHeight:".tablMainThree",
    scrollHeightPC:45,
    edit:false
});
/*为表格添加横向滚动条*/
$(".tablMainThree").panel({
    iWheelStep:32,
    vScroll:false,
    scrollWResize:true
});

